using System;
class HelloWorld
{
    static void Main()
    {
        //Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
        //4 -> да
        //-3 -> нет
        //7 -> нет

        Console.WriteLine("Пожалуйства, введите число А для проверки четное оно или нет"); // блок ввода чисел
        string A = Console.ReadLine() ?? "";
        int NumberFromA = int.Parse(A);

        if ((NumberFromA % 2) == 0)
        { // проверка, являетсяя ли число четным
            Console.WriteLine("да");
        }
        else
        {
            Console.WriteLine("нет"); // присваивает числу статус не четности, если не выполнено условие  
        }
    }
}

