using System;
class HelloWorld
{
    static void Main()
    {
        //Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
        //5 -> 2, 4
        //8 -> 2, 4, 6, 8

        Console.WriteLine("Пожалуйства, введите число А"); // блок ввода чисел
        string A = Console.ReadLine() ?? "";
        int NumberFromA = int.Parse(A);
        int count = 1; //щетчик для цикла
        while (count != NumberFromA)//цикл для проверки каждого числа от 0 до NumberFromA на четность
        {
            if ((count % 2) == 0) { Console.Write($"{count} "); } //вывод ряда числек в строку
            count++;
        }
    }
}
